posts/2021-07-09-psake-enhancements/index.html
<!DOCTYPE html>
<html lang="en">
<head>
<meta charset="utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Psake Enhancements</title>
<meta name="generator" content="Org Mode" />
<meta name="author" content="Florian Winkelbauer">
<link rel="stylesheet" href="/site.css" type="text/css">
</head>
<body>
<div id="preamble" class="status">
<nav>
<a href="/">Home</a>
<a href="/notes">Notes</a>
<a href="/posts">Posts</a>
<a href="/projects">Projects</a>
</nav>
</div>
<div id="content" class="content">
<header>
<h1 class="title">Psake Enhancements</h1>
</header><p>
<a href="https://github.com/psake/psake">Psake</a> is <code>make</code>-like tool written in PowerShell. Instead of a <code>makefile</code> you
write a <code>psakefile.ps1</code> which consists of a set of tasks. Calling <code>psake &lt;task
name&gt;</code> searches for a <code>psakefile.ps1</code> in the current directory to then call the
given task. Most of the time I store my <code>psakefile.ps1</code> in the root of my git
project, which means that I have to set the working directory of my terminal to
this directory. I have recently created a small PowerShell script which helps me
to remember task names (using <a href="https://github.com/junegunn/fzf">fzf</a>) while also giving me the option to call
<code>psake</code> anywhere in my git projects:
</p>

<div class="org-src-container">
<pre class="src src-powershell">$root = git rev-parse --show-toplevel
if ($LASTEXITCODE -ne 0) { exit $LASTEXITCODE }

try {
    Push-Location $root

    # This search approach is not perfect, but works for my needs
    $tasks = Get-Content 'psakefile.ps1' |
      Select-String -Pattern '^task\s+(.+?)\s+' -AllMatches |
      ForEach-Object { $_.Matches.Groups[1].Value }

    $selectedTask = $tasks | fzf

    if ($selectedTask) {
        psake $selectedTask
    }
}
finally {
    Pop-Location
}
</pre>
</div>
</div>
<div id="postamble" class="status">
<p class="date">Published: 2021-07-09</p>
<footer>
<p>Copyright 2024, Florian Winkelbauer. All rights reserved.</p>
</footer>
</div>
</body>
</html>